{
  "date": "2025-03-28T20:43:52.188Z",
  "count": 2,
  "posts": [
    {
      "postId": "3596971118730573464",
      "username": "_sjpeace_",
      "mediaType": "album",
      "caption": "Yesterday was a day unlike any other, a day that revealed the beauty and precision of God’s plan in the most profound way. At 4 PM, I stood at my grandmother’s grave, placing her in the earth, my heart heavy with the weight of loss. Just four hours later, at 8 PM, my sister brought a new life into this world, my niece.\n\nLife and death, grief and joy, sorrow and hope, all woven together by divine wisdom. One soul completed its journey, returning to its Creator, while another took its first breath, stepping into the unknown path ahead. Moments like these remind me that nothing in this world is random. We often see death as an ending, but in reality, it is only a transition, just as birth is the beginning of a new test, a new purpose, a new unfolding of destiny.\n\nWe say Inna lillahi wa inna ilayhi rajiun, we belong to Allah, and to Him we return, but today, I felt its meaning settle deeper in my heart than ever before. My grandmother’s passing was not an end, but a return to her Creator, a homecoming to the mercy of the Most Compassionate. And in the very same day, my niece’s arrival was a reminder that while one chapter closes, another opens, each written by the Best of Planners.\n\nImam Ali AS once said, “The world is a place of passage, not a place of permanence.” Yesterday, I witnessed that truth manifest before my eyes. One life fading, another emerging, both carrying the weight of divine will. It is a humbling reminder that we are all travelers on this path, moving between the temporary and the eternal, between this world and the next.\n\nAs we bid farewell to my beloved grandmother, Syeda Surriya Iftikhar binte Syed Sawar Ali Jeffery, I ask you all to recite Surah Al Fatiha for the elevation of her soul. May Allah SWT envelop her in His infinite mercy, expand and illuminate her grave, and grant her proximity to the Ahlul Bayt AS in the highest stations of Jannah. O Allah, forgive her shortcomings, grant her eternal peace, and reunite us with her under Your divine mercy.\n\nAlhamdulillah for all that He gives and all that He takes.",
      "hasEvent": false,
      "eventKeywords": [],
      "url": "https://instagram.com/p/DHrAizHRnaY",
      "engagementCount": 318,
      "engagementRatio": 0.318,
      "createdAt": "2025-03-26T18:06:33.000Z",
      "importance": {
        "score": 0.6,
        "priority": "high",
        "reason": "Recent post with good score"
      },
      "contentCategories": {
        "primary": "Selfie",
        "confidence": 0.5,
        "hashtags": []
      }
    },
    {
      "postId": "3596882795973705335",
      "username": "marshobrecker",
      "mediaType": "album",
      "caption": "🩸UPCOMING SHOWS 🩸\n\nFriday March 28th \nPROMOTE PERFORMANCE gala afterparty \n10PM SHARP at @performance.space.new.york \nI will be bringing the abject to the function & opening the night with @macyrodman & @charleneincarnate on decks RIGHT AT 10PM 🩸\nFREE to attend\n\nTHURSDAY APRIL 10th\n@thirst.night DOLLS!DOLLS!DOLLS! \n8PM at @thesultanroom \nFor the first time ever, THIRST has a 100% trans femme cast and I am so thrilled to be there supporting some of the absolute best performers in our community (as well as some of my all time biggest dance idols flying in from the west coast)\nTickets selling fast, would mean the WORLD to me if this one sold out because these women deserve every single dollar you have. (Discounts available for all dolls & SWers - DM me)\n\nFRIDAY APRIL 11th\n@mascarade.nyc \n10PM at @the_parkside_lounge_nyc \nDancing with the boys!!\n\nTickets to all of the above in my bio - and can’t wait to share some other things in the works very soon 👀 \n📸 by @koo.rah at Valentine’s THIRST",
      "hasEvent": false,
      "eventKeywords": [],
      "url": "https://instagram.com/p/DHqsdiIuf53",
      "engagementCount": 250,
      "engagementRatio": 0.25,
      "createdAt": "2025-03-26T15:11:04.000Z",
      "importance": {
        "score": 0.48,
        "priority": "medium",
        "reason": "Recent post with high engagement"
      },
      "contentCategories": {
        "primary": "Event",
        "secondary": "Selfie",
        "confidence": 0.6000000000000001,
        "hashtags": []
      }
    }
  ]
}